Catalogs/Контрагенты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Контрагенты</Name>
			<Comment>Трейд Софт</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КодКонтрагента</Name>
					<Comment>Уникальный код контрагента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтзывПерсональныхДанных</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЧасовойПояс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИО_ПФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИО_Действующее</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИО_Реестр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьДанныеОБанкротстве</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Телефоны</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидТелефона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыТелефонов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидНомера</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыТелефонов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контакт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛицаПоДолжнику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛицаПоДолжнику</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗапретЗвонка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоЗапретаЗвонка</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонецЗапретаЗвонка</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодГорода</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтраны</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Добавочный</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДляПоиска</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФИО</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Фамилия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отчество</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/СклонениеФИО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СклонениеФИО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИзмененоВРучную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Именительный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Родительный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Творительный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Предолжный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дательный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>120</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инициалы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Контрагенты/Ext/ManagerModule.bsl
Процедура ЗаполнитьСклоненияВФоне(ПараметрыЗаполнения, Адрес) Экспорт

	НовыеИмена = ОбработатьИмена(ПараметрыЗаполнения["Имена"]);
	
	Для каждого Имя Из НовыеИмена Цикл
	
		ЗаписатьНаборСклонений(ПараметрыЗаполнения["Контрагент"], Имя);
	
	КонецЦикла;
	
	Счетчик = 0;
	Пока Счетчик < 10000000 Цикл
	
		Счетчик = Счетчик + 1;
	
	КонецЦикла;

КонецПроцедуры

#Область Техническая

Функция ОбработатьИмена(ИменаИзТабличнойЧасти)

	НовыеИмена = Новый Массив;
	
	Для каждого Имя Из ИменаИзТабличнойЧасти Цикл
	
		НовоеИмя = ОбработатьИмя(Имя);
		Если Не ЗначениеЗаполнено(НовоеИмя) Тогда
		
			Продолжить;
		
		КонецЕсли;
		НовыеИмена.Добавить(НовоеИмя);
	
	КонецЦикла;
	
	Возврат НовыеИмена;

КонецФункции

Функция ОбработатьИмя(Знач Имя)

	НовоеИмя = СокрЛП(Имя);
	НовоеИмя = ТРег(НовоеИмя);
	НовоеИмя = СтрЗаменить(НовоеИмя, "ё", "е");
	
	Возврат НовоеИмя;

КонецФункции

Функция ЗаписатьНаборСклонений(Элемент, ИмяТЧ)

	НаборЗаписей = РегистрыСведений.СклонениеФИО.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Контрагент.Установить(Элемент);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Контрагент = Элемент;
	
	Выборка = РегистрыСведений.СклонениеФИО.ИзмененоВРучную(Элемент, ИмяТЧ);
	Если Выборка <> Неопределено И Выборка.Следующий() Тогда
	
		НоваяЗапись.Инициалы = Выборка.Инициалы;
		НоваяЗапись.Именительный = Выборка.Именительный;
		НоваяЗапись.Родительный = Выборка.Родительный;
		НоваяЗапись.Творительный = Выборка.Творительный;
		НоваяЗапись.Предолжный = Выборка.Предолжный;
		НоваяЗапись.Дательный = Выборка.Дательный;
		НоваяЗапись.ИзмененоВРучную = Выборка.ИзмененоВРучную;
		Возврат Ложь;
	
	КонецЕсли;
	
	НоваяЗапись.Инициалы = Инициалы(ИмяТЧ);
	
	ЗаписатьСклонения(НоваяЗапись, ИмяТЧ);
	
	НаборЗаписей.Записать();
	
	Возврат Истина;

КонецФункции // ()

Функция ЗаписатьСклонения(Запись, ФИОКонтрагента)

	// Если протащить пол, можно точно указать
	Запись.Именительный = ПолучитьПадеж(ФИОКонтрагента, "Именительный");
	Запись.Родительный = ПолучитьПадеж(ФИОКонтрагента, "Родительный");
	Запись.Творительный = ПолучитьПадеж(ФИОКонтрагента, "Творительный");
	Запись.Предолжный = ПолучитьПадеж(ФИОКонтрагента, "Предложный");
	Запись.Дательный = ПолучитьПадеж(ФИОКонтрагента, "Дательный");

	Возврат Запись;

КонецФункции // ()

Функция ПолучитьПадеж(ФИОКонтрагента, Падеж)

	Формат = "ПД=" + Падеж;
	Результат = ПолучитьСклоненияСтроки(ФИОКонтрагента, , Формат);
	
	Ответ = "";
	Если Результат.Количество() > 0 Тогда
	
		Ответ = Результат[0];
	
	КонецЕсли;
	
	Возврат Ответ;

КонецФункции

Функция Инициалы(СтрФИО)
	
	сФио = ФизическиеЛицаКлиентСервер.ЧастиИмени(СтрФИО);
	Если сФио.Свойство("Имя") И сФио.Свойство("Отчество") Тогда
		Инициалы = Лев(сФио.Имя,1) + " " +  Лев(сФио.Отчество,1);
		Возврат Инициалы;
	КонецЕсли;
	
	Возврат "";
КонецФункции

#КонецОбласти
